#1: Даны два списка фруктов. Получить список фруктов, присутствующих в обоих исходных списках.
#   Примечание: Списки фруктов создайте вручную в начале файла.
fruits1 = ['яблоки', 'груши', 'манго', 'апельсины']
fruits2 = ['яблоки', 'груши']
result = []
for fruit in fruits1 :
    if fruit in fruits2 :
        result.append(fruit)
print(result)
result = [fruit for fruit in fruits1 if fruit in fruits2]
print(result)
#2: Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
#Элемент кратен 3,
#Элемент положительный,
#Элемент не кратен 4.
#Примечание: Список с целыми числами создайте вручную в начале файла.
# Не забудьте включить туда отрицательные числа. 10-20 чисел в списке вполне достаточно.
numbers = [ 3, 4, 9, 12, -3, -4, -9, -12]
result = []
result = [number for number in numbers if number > 0 and number % 3 == 0 and number % 4 != 0]
print(result)
#3. Напишите функцию которая принимает на вход список.
# Функция создает из этого списка новый список из квадратных корней чисел
# (если число положительное) и самих чисел (если число отрицательное)
# и возвращает результат (желательно применить генератор и тернарный оператор при необходимости).
# В результате работы функции исходный список не должен измениться.
#Например:
#old_list = [1, -3, 4]
#result = [1, -3, 2]
#    Примечание: Список с целыми числами создайте вручную в начале файла.
#    Не забудьте включить туда отрицательные числа. 10-20 чисел в списке вполне достаточно.
import math
old_list = [1, -3, 4, -6, 12, 33]
def new_list (input_list) :
    result = [math.sqrt(number) if number > 0 else number for number in input_list ]
    return result
result = new_list(old_list)
print(result)
print(old_list)
#4. Написать функцию которая принимает на вход число от 1 до 100.
# Если число равно 13, функция поднимает исключительную ситуации ValueError
# иначе возвращает введенное число, возведенное в квадрат.
#Далее написать основной код программы. Пользователь вводит число.
# Введенное число передаем параметром в написанную функцию и печатаем результат, который вернула функция.
# Обработать возможность возникновения исключительной ситуации, которая поднимается внутри функции.
def none_namber (number):
    if number == 13 or number < 1 or number > 100:
        raise ValueError
    else :
        return number ** 2
number = int(input('Введите число от 1 до 100: '))
try:
    result = none_namber(number)
except ValueError:
    print('Неправильный ввод')
else:
    print(result)